<br/>
<img src="images/cd-logo-blue-600x600.png" alt="" width="130px" align="left"/>
<img src="images/cd-logo-blue-600x600.png" alt="" width="130px" align="right"/>
<div align="center">
<h2>Bootcamp Data Science - Módulo 3</h2><br/>
<h1>Python y SQL</h1>
<br/><br/>
    <b>Instructor Principal:</b> Jesús Ortiz jortiz@codingdojo.la <br/>
    <b>Instructor Asistente:</b> Daniela Blanco dblanco@codingdojo.la<br/><br/>
    <b>Coding Dojo</b>
</div>
<br>

# Clase de Introducción a SQL con Python

## Objetivos de la Clase

- Entender qué es SQL y para qué se utiliza
- Aprender cómo interactuar con una base de datos SQL utilizando Python
- Familiarizarse con los comandos básicos de SQL: SELECT, WHERE, ORDER BY, JOIN, GROUP BY

## ¿Qué es SQL?

SQL (Structured Query Language) es un lenguaje de programación utilizado para comunicarse con y manipular bases de datos. 

## Interactuando con SQL usando Python

Python proporciona varias bibliotecas para interactuar con bases de datos SQL. En esta clase, utilizaremos `sqlite3`, que permite interactuar con una base de datos SQLite.

Primero, necesitamos importar la biblioteca y conectar a la base de datos.

```python
import sqlite3

conn = sqlite3.connect('bookstore.db')
```

## Creando una Base de Datos

Vamos a crear una base de datos para una tienda de libros. Nuestra base de datos tendrá una tabla llamada `books` con las siguientes columnas: `id`, `title`, `author`, `genre`, `price`.

```python
c = conn.cursor()

c.execute("""
    CREATE TABLE books (
        id INTEGER PRIMARY KEY,
        title TEXT,
        author TEXT,
        genre TEXT,
        price REAL
    )
""")

conn.commit()
```

Ahora, vamos a insertar algunos libros en nuestra tabla.

```python
books = [
    ('To Kill a Mockingbird', 'Harper Lee', 'Fiction', 18.99),
    ('1984', 'George Orwell', 'Dystopian', 8.99),
    ('The Great Gatsby', 'F. Scott Fitzgerald', 'Classic', 14.99),
]

c.executemany("INSERT INTO books (title, author, genre, price) VALUES (?, ?, ?, ?)", books)

conn.commit()
```

## Consultando Datos con SELECT

El comando SELECT se utiliza para seleccionar datos de una base de datos. Los datos devueltos se almacenan en una tabla de resultados.

```python
c.execute("SELECT * FROM books")
print(c.fetchall())
```

## Filtrando Datos con WHERE

El comando WHERE se utiliza para filtrar registros.

```python
c.execute("SELECT * FROM books WHERE genre = 'Fiction'")
print(c.fetchall())
```

## Ordenando Datos con ORDER BY

El comando ORDER BY se utiliza para ordenar los registros en los resultados de una consulta.

```python
c.execute("SELECT * FROM books ORDER BY price DESC")
print(c.fetchall())
```

## Uniendo Tablas con JOIN

El comando JOIN se utiliza para combinar filas de dos o más tablas.

Primero, vamos a crear una segunda tabla `sales` y luego realizaremos una consulta JOIN.

```python
c.execute("""
    CREATE TABLE sales (
        id INTEGER PRIMARY KEY,
        book_id INTEGER,
        sale_date TEXT,
        quantity INTEGER,
        FOREIGN KEY(book_id) REFERENCES books(id)
    )
""")

sales = [
    (1, '2022-01-01', 2),
    (1, '2022-01-03', 1),
    (2, '2022-01-03', 1),
]

c.executemany("INSERT INTO sales (book_id, sale_date, quantity) VALUES (?, ?, ?)", sales)

conn.commit()

c.execute("""
    SELECT books.title, sales.sale_date, sales.quantity 
    FROM books 
    JOIN sales ON books.id = sales.book_id
""")
print(c.fetchall())
```

## Agrupando Datos con GROUP BY

El comando GROUP BY se utiliza junto con funciones agregadas (COUNT, MAX, MIN, SUM, AVG) para agrupar el conjunto de resultados por una o más columnas.

```python
c.execute("""
    SELECT books.title, SUM(sales.quantity) 
    FROM books 
    JOIN sales ON books.id = sales.book_id 
    GROUP BY books.title
""")
print(c.fetchall())
```

Finalmente, no olvides cerrar la conexión a la base de datos.

```python
conn.close()
```

In [1]:
import sqlite3

conn = sqlite3.connect('bookstore.db')

In [3]:
c = conn.cursor()

c.execute("""
    CREATE TABLE books_new (
        id INTEGER PRIMARY KEY,
        title TEXT,
        author TEXT,
        genre TEXT,
        price REAL
    )
""")

conn.commit()

In [4]:
c.execute("""INSERT INTO books_new (title, author, genre, price) VALUES ('HPOF', 'J.K ROWLING', 'FICTION', 20)""")

In [5]:
conn.commit()

In [7]:
books = [
    ('To Kill a Mockingbird', 'Harper Lee', 'Fiction', 18.99),
    ('1984', 'George Orwell', 'Dystopian', 8.99),
    ('The Great Gatsby', 'F. Scott Fitzgerald', 'Classic', 14.99),
]

c.executemany("INSERT INTO books_new (title, author, genre, price) VALUES (?, ?, ?, ?)", books)

conn.commit()

In [12]:
c.execute("SELECT * FROM books_new")
print(c.fetchall())

[(1, 'HPOF', 'J.K ROWLING', 'FICTION', 20.0), (2, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 18.99), (3, '1984', 'George Orwell', 'Dystopian', 8.99), (4, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Classic', 14.99)]

In [22]:
c.execute("SELECT * FROM books_new WHERE price < 15 or genre = 'Fiction' ")
print(c.fetchall())

[(2, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 18.99), (3, '1984', 'George Orwell', 'Dystopian', 8.99), (4, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Classic', 14.99)]

In [26]:
c.execute("SELECT title, price FROM books_new ORDER BY price ASC")
print(c.fetchall())

[('1984', 8.99), ('The Great Gatsby', 14.99), ('To Kill a Mockingbird', 18.99), ('HPOF', 20.0)]

In [28]:
c.execute("""
    CREATE TABLE sales_new (
        id INTEGER PRIMARY KEY,
        book_id INTEGER,
        sale_date TEXT,
        quantity INTEGER,
        FOREIGN KEY(book_id) REFERENCES books(id)
    )
""")
          
conn.commit()

In [35]:
sales = [
    (1, '2022-01-01', 10),
    (1, '2022-01-02', 10),
    (2, '2022-01-03', 2),
     (3, '2022-01-01', 1),
]

c.executemany("INSERT INTO sales_new (book_id, sale_date, quantity) VALUES (?, ?, ?)", sales)

conn.commit()

In [33]:
c.execute("""
    SELECT books_new.title, sales_new.sale_date, sales_new.quantity 
    FROM books_new 
    JOIN sales_new ON books_new.id = sales_new.book_id
""")
print(c.fetchall())

[('HPOF', '2022-01-01', 10), ('HPOF', '2022-01-02', 10), ('To Kill a Mockingbird', '2022-01-03', 2), ('1984', '2022-01-01', 1)]

In [36]:
c.execute("""
    SELECT books_new.title, SUM(sales_new.quantity) 
    FROM books_new 
    JOIN sales_new ON books_new.id = sales_new.book_id 
    GROUP BY books_new.title
""")
print(c.fetchall())

[('1984', 2), ('HPOF', 40), ('To Kill a Mockingbird', 4)]

In [37]:
conn.close()

# Unidad 2: Funciones Incorporadas, Fechas, Horas y Nulls en SQL con Python

## Objetivos de la Unidad

- Aprender a usar funciones incorporadas en SQL
- Entender cómo manejar fechas y horas en SQL
- Aprender a manejar valores NULL en SQL

## Funciones Incorporadas en SQL

SQL proporciona una serie de funciones incorporadas que puedes utilizar para realizar cálculos en tus datos.

### COUNT

La función COUNT() devuelve el número de filas que coinciden con un criterio especificado.

```python
c.execute("SELECT COUNT(*) FROM books")
print(c.fetchall())
```

### SUM

La función SUM() devuelve la suma total de una columna numérica.

```python
c.execute("SELECT SUM(price) FROM books")
print(c.fetchall())
```

### AVG

La función AVG() devuelve el valor promedio de una columna numérica.

```python
c.execute("SELECT AVG(price) FROM books")
print(c.fetchall())
```

### MIN y MAX

Las funciones MIN() y MAX() devuelven el valor más bajo y más alto de una columna numérica, respectivamente.

```python
c.execute("SELECT MIN(price), MAX(price) FROM books")
print(c.fetchall())
```

## Manejo de Fechas y Horas en SQL

SQLite no tiene un tipo de dato separado para almacenar fechas y/o tiempos, pero SQLite es capaz de almacenar fechas y horas como TEXT, REAL o INTEGER.

En nuestro ejemplo, almacenamos las fechas de venta como TEXT en el formato 'YYYY-MM-DD'. Podemos usar la función DATE() para manipular estos datos.

Por ejemplo, para obtener todas las ventas realizadas en enero de 2022, podríamos hacer lo siguiente:

```python
c.execute("""
    SELECT * 
    FROM sales 
    WHERE DATE(sale_date) BETWEEN '2022-01-01' AND '2022-01-31'
""")
print(c.fetchall())
```

## Manejo de Valores NULL en SQL

Un valor NULL en SQL significa que no se ha ingresado ningún valor en ese campo. Es diferente de un campo vacío o un campo con un valor de cero.

Podemos usar IS NULL o IS NOT NULL para filtrar registros con valores NULL.

Por ejemplo, si queremos encontrar todos los libros que no tienen un precio asignado, podríamos hacer lo siguiente:

```python
c.execute("SELECT * FROM books WHERE price IS NULL")
print(c.fetchall())
```

Y eso concluye nuestra segunda unidad sobre SQL con Python. ¡Espero que hayas encontrado esta información útil!

In [15]:
c.execute("SELECT COUNT(*) FROM books")
print(c.fetchall())

[(3,)]

In [16]:
c.execute("SELECT SUM(price) FROM books")
print(c.fetchall())

[(42.97,)]

In [17]:
c.execute("SELECT AVG(price) FROM books")
print(c.fetchall())

[(14.323333333333332,)]

In [18]:
c.execute("SELECT MIN(price), MAX(price) FROM books")
print(c.fetchall())

[(8.99, 18.99)]

In [19]:
c.execute("""
    SELECT * 
    FROM sales 
    WHERE DATE(sale_date) BETWEEN '2022-01-01' AND '2022-01-31'
""")
print(c.fetchall())

[(1, 1, '2022-01-01', 2), (2, 1, '2022-01-03', 1), (3, 2, '2022-01-03', 1)]

In [20]:
c.execute("SELECT * FROM books WHERE price IS NULL")
print(c.fetchall())

[]

# Unidad 3: Filtros, WHERE y UNION en SQL con Python

Para interactuar con una base de datos SQL desde Python, puedes usar la biblioteca `sqlite3` que viene incluida con Python. A continuación, se muestran ejemplos de cómo usar filtros, WHERE y UNION con esta biblioteca.

## Filtros y WHERE

Primero, necesitas conectar a tu base de datos y crear un cursor:

```python
import sqlite3

conn = sqlite3.connect('libros.db')
c = conn.cursor()
```

Ahora, puedes ejecutar consultas SQL. Por ejemplo, para obtener los libros publicados después del año 2000:

```python
c.execute("SELECT * FROM libros WHERE año_publicacion > 2000")
print(c.fetchall())
```

Si quieres filtrar por más de una condición, puedes usar `AND` y `OR`. Por ejemplo, para obtener los libros publicados después del año 2000 por "Autor X":

```python
c.execute("""
SELECT * FROM libros 
WHERE año_publicacion > 2000 AND autor = 'Autor X'
""")
print(c.fetchall())
```

## UNION

Para combinar los resultados de dos tablas, puedes usar `UNION`. Supongamos que tienes dos tablas, `libros_ficcion` y `libros_no_ficcion`. Aquí está cómo podrías obtener una lista de todos los libros:

```python
c.execute("""
SELECT * FROM libros_ficcion 
UNION 
SELECT * FROM libros_no_ficcion
""")
print(c.fetchall())
```

Recuerda cerrar la conexión cuando hayas terminado:

```python
conn.close()
```

Estos son solo ejemplos básicos. En la práctica, querrás manejar errores y quizás usar la biblioteca `sqlite3` en el contexto de un programa más grande. Pero espero que esto te dé una idea de cómo puedes trabajar con SQL en Python.